NOTEs.org
#+SETUPFILE: ~/Documents/style.setup
#+STARTUP: align
#+LATEX_HEADER: \usepackage{ulem}
#+LATEX_HEADER: \usepackage{ctex}
#+LaTeX_HEADER: \sectionfont{\normalfont\scshape}
#+LaTeX_HEADER: \subsectionfont{\normalfont\itshape}
#+TITLE: 笔记
#+AUTHOR: whiothes

* 笔记
** Q & A
*** invalid environment block
    [[https://clay-atlas.com/us/blog/2020/03/19/linux-note-how-to-solve-error-invalid-environment-block-press-any-key-to-continue/][https://clay-atlas.com/us/blog/2020/03/19/linux-note-how-to-solve-error-invalid-environment-block-press-any-key-to-continue/]]
*** gdb print full value
    #+begin_src sh
      set print elements 0
    #+end_src
*** vim negative lookahead
    [[https://stackoverflow.com/questions/21148467/is-there-a-way-to-do-negative-lookahead-in-vim-regex]]
    #+begin_quote
    # abc(?!.*xyz)
    /abc\(.*xyz\)\@!
    #+end_quote
*** memory leak
    Q: find memory leak of a running process
    A: [[https://unix.stackexchange.com/questions/36450/how-can-i-find-a-memory-leak-of-a-running-process]]

    #+begin_src sh
      /proc/$PID/smaps
    #+end_src
*** backtrace():[[https://stackoverflow.com/questions/6934659/how-to-make-backtrace-backtrace-symbols-print-the-function-names][How to make backtrace()/backtrace_symbols() print the function names?]]
    ~gcc -r~
*** vim: [[https://stackoverflow.com/questions/3997078/how-to-paste-yanked-text-into-the-vim-command-line#3997110][How to paste yanked text into the Vim command line - Stack Overflow]]
    ~Ctrl - R~, then ~"~
    ~help register~
*** curl: curl xxx.sh and execute [fn:3]
    #+begin_src bash
      curl https://xxx.sh | bash
    #+end_src

*** Git: [[https://stackoverflow.com/questions/2227062/how-do-i-move-a-git-branch-out-into-its-own-repository][How do I move a Git branch out into its own repository? - Stack Overflow]]
*** Lock-Free
    [[https://preshing.com/20120612/an-introduction-to-lock-free-programming/][An Introduction to Lock-Free Programming]]

    std::atomic 在 C 语言中可以通过 =volatile= 实现
*** PUT 和 POST 的区别
    [[https://www.w3.org/Protocols/rfc2616/rfc2616-sec9.html#sec9.6][HTTP/1.1: Method Definitions]]
    #+begin_quote
    The fundamental difference between the POST and PUT requests is reflected in the different meaning of the Request-URI. The URI in a POST request identifies the resource that will handle the enclosed entity. That resource might be a data-accepting process, a gateway to some other protocol, or a separate entity that accepts annotations. In contrast, the URI in a PUT request identifies the entity enclosed with the request -- the user agent knows what URI is intended and the server MUST NOT attempt to apply the request to some other resource. If the server desires that the request be applied to a different URI,
 it MUST send a 301 (Moved Permanently) response; the user agent MAY then make its own decision regarding whether or not to redirect the request.
    #+end_quote
*** strongSwan 依赖
    * gperf
      #+begin_src sh
        dnf --enablerepo=PowerTools install gperf
      #+end_src
    * gmp
      #+begin_src sh
        yum install gmp-devel
      #+end_src
*** [[https://zhuanlan.zhihu.com/p/137041568][如何系统地学习数据结构与算法？ - 知乎]]
*** check threads
    [[https://www.golinuxcloud.com/tutorial-linux-memory-management-overview/][4 commands to check thread count per process (threads vs processes) in Linux]]
*** rpm install with dependencies
    #+begin_src sh
      yum --nogpgcheck localinstall xxx.rpm
    #+end_src
    [[https://stackoverflow.com/questions/13876875/how-to-make-rpm-auto-install-dependencies][linux - How to make rpm auto install dependencies - Stack Overflow]]
