NOTEs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-12-09 Thu 23:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="whiothes" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org987ce0b">笔记</a>
<ul>
<li><a href="#orgee67bf4">Q &amp; A</a>
<ul>
<li><a href="#org585feab">vim negative lookahead</a></li>
<li><a href="#org4376872">memory leak</a></li>
<li><a href="#org3ca3401">backtrace():How to make backtrace()/backtrace_symbols() print the function names?</a></li>
<li><a href="#org7e75027">vim: How to paste yanked text into the Vim command line - Stack Overflow</a></li>
<li><a href="#org7736962">curl: curl xxx.sh and execute </a></li>
<li><a href="#org145031d">Git: How do I move a Git branch out into its own repository? - Stack Overflow</a></li>
<li><a href="#org9b7e823">Lock-Free</a></li>
<li><a href="#org4f26105">PUT 和 POST 的区别</a></li>
<li><a href="#orgae23f65">strongSwan 依赖</a></li>
<li><a href="#orgdeab050">如何系统地学习数据结构与算法？ - 知乎</a></li>
<li><a href="#orgf378dd3">check threads</a></li>
<li><a href="#orgc463a1d">rpm install with dependencies</a></li>
<li><a href="#org85af063">gcc error when inline without static</a></li>
<li><a href="#org6586e53">c++ - How to identify platform/compiler from preprocessor macros? - Stack Overflow</a></li>
<li><a href="#org490a6bb">valgrind messages</a></li>
<li><a href="#org308598f">mysql C API: still reachable</a></li>
<li><a href="#orgd58ac1d">gdb 打印数组</a></li>
<li><a href="#orga6b3b3b">recover/undo/get back deleted commit (even remote)</a></li>
<li><a href="#org4a69536">linux - How to redirect the output of an application in background to /dev/null - Stack Overflow</a></li>
<li><a href="#orgda32ced">CS Visualized: Useful Git Commands - DEV</a></li>
<li><a href="#org263b287">slice an array in bash</a></li>
<li><a href="#org52cd746">gcc expand macros</a></li>
<li><a href="#org620f377"><code>sed</code>: How to use variables in <code>sed</code></a></li>
<li><a href="#orgba297fa">Ubuntu: How to disable FireWall</a></li>
<li><a href="#org08587f9">Git delete remote branch</a></li>
<li><a href="#orgf97e469">Makefile for Kenel module</a></li>
<li><a href="#org41cab78">Get client sock IP addr</a></li>
<li><a href="#orgbfbc548">Mac 清理右键多余选单</a></li>
<li><a href="#org230e9cb">differences between preprocessor and <code>inline</code></a></li>
<li><a href="#org6235a27"><code>w !sudo tee %</code> principle</a></li>
<li><a href="#orgfe01a0b">Figure out the largest directory</a></li>
<li><a href="#org8f47717"><code>long</code> 和 <code>long long</code> 的区别</a></li>
<li><a href="#orgc663b2d">删除特殊符号的文件名</a></li>
<li><a href="#orge9b7a57">通过 Netfilter 自写模块实现过滤器</a></li>
<li><a href="#orgde85f24">nginx: urlencded url not found</a></li>
<li><a href="#orge319090">数据结构</a></li>
<li><a href="#org3a1915a">MySQL</a></li>
<li><a href="#org19c02ca">BASH</a></li>
<li><a href="#org4561e8f"><code>Centos</code></a></li>
<li><a href="#org8d53600"><code>segfault at 1p xxxx sp xxxx</code></a></li>
<li><a href="#org0bbe508">正则表达式过滤指定字符串</a></li>
<li><a href="#org4e13bac">查看 IPC 信息的命令</a></li>
<li><a href="#org02b514d">栈溢出</a></li>
<li><a href="#org8a6657c"><code>volatile</code></a></li>
<li><a href="#orga2c485d">Emacs</a></li>
<li><a href="#org42f2c3b">Differences between <code>RUID</code> and <code>EUID</code></a></li>
<li><a href="#orgc744432">static 用法 </a></li>
<li><a href="#org4f1fb76">使用 <code>snprintf</code> 替换 <code>strcpy/sprintf/strncpy</code></a></li>
</ul>
</li>
<li><a href="#orgb0ca650">Book Notes</a>
<ul>
<li><a href="#org98822fe">Design Pattern</a></li>
<li><a href="#org491ac39">AD</a></li>
<li><a href="#org00f97a7">Kernel</a></li>
<li><a href="#orgebee8a6">System</a></li>
<li><a href="#org18a295c">Language</a></li>
<li><a href="#orga991eaf">数据库</a></li>
<li><a href="#org6d609a6">版本控制</a></li>
<li><a href="#org7f46831">其他</a></li>
<li><a href="#org8880cf8">org-mode</a></li>
<li><a href="#org139d252">区块链</a></li>
<li><a href="#org263c49b">算法</a></li>
<li><a href="#orgd03cdee">时间管理</a></li>
</ul>
</li>
<li><a href="#orgb5dc847">随笔</a>
<ul>
<li><a href="#org4cdfcd8">Principles of Git</a></li>
<li><a href="#orgd21f458">Frequent git commands</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb057ccb"><span class="todo TODO">TODO</span> 待学</a>
<ul>
<li><a href="#orge5aac58">汇编</a></li>
<li><a href="#orgaca7ca2">算法</a></li>
<li><a href="#org7645bf0">源码学习</a>
<ul>
<li><a href="#org079e065">libevent/libuv</a></li>
<li><a href="#org0bc95b9">linux</a></li>
</ul>
</li>
<li><a href="#org3b47661">服务器</a>
<ul>
<li><a href="#org85c3f60">网络</a></li>
</ul>
</li>
<li><a href="#orgaaae112">Linux 内核及驱动</a></li>
</ul>
</li>
<li><a href="#orgb28870d">项目经验</a>
<ul>
<li><a href="#orgc1c7161">首信历史项目</a></li>
<li><a href="#orgb324fc9">浙星历史项目</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org987ce0b" class="outline-2">
<h2 id="org987ce0b">笔记</h2>
<div class="outline-text-2" id="text-org987ce0b">
</div>
<div id="outline-container-orgee67bf4" class="outline-3">
<h3 id="orgee67bf4">Q &amp; A</h3>
<div class="outline-text-3" id="text-orgee67bf4">
</div>
<div id="outline-container-org585feab" class="outline-4">
<h4 id="org585feab">vim negative lookahead</h4>
<div class="outline-text-4" id="text-org585feab">
<p>
<a href="https://stackoverflow.com/questions/21148467/is-there-a-way-to-do-negative-lookahead-in-vim-regex">https://stackoverflow.com/questions/21148467/is-there-a-way-to-do-negative-lookahead-in-vim-regex</a>
</p>
<blockquote>
<p>
/abc\(.*xyz\)\@!
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org4376872" class="outline-4">
<h4 id="org4376872">memory leak</h4>
<div class="outline-text-4" id="text-org4376872">
<p>
Q: find memory leak of a running process
A: <a href="https://unix.stackexchange.com/questions/36450/how-can-i-find-a-memory-leak-of-a-running-process">https://unix.stackexchange.com/questions/36450/how-can-i-find-a-memory-leak-of-a-running-process</a>
</p>

<div class="org-src-container">
<pre class="src src-sh">/proc/$<span style="color: #7590db;">PID</span>/smaps
</pre>
</div>
</div>
</div>
<div id="outline-container-org3ca3401" class="outline-4">
<h4 id="org3ca3401">backtrace():<a href="https://stackoverflow.com/questions/6934659/how-to-make-backtrace-backtrace-symbols-print-the-function-names">How to make backtrace()/backtrace_symbols() print the function names?</a></h4>
<div class="outline-text-4" id="text-org3ca3401">
<p>
<code>gcc -r</code>
</p>
</div>
</div>
<div id="outline-container-org7e75027" class="outline-4">
<h4 id="org7e75027">vim: <a href="https://stackoverflow.com/questions/3997078/how-to-paste-yanked-text-into-the-vim-command-line#3997110">How to paste yanked text into the Vim command line - Stack Overflow</a></h4>
<div class="outline-text-4" id="text-org7e75027">
<p>
<code>Ctrl - R</code>, then <code>"</code>
<code>help register</code>
</p>
</div>
</div>
<div id="outline-container-org7736962" class="outline-4">
<h4 id="org7736962">curl: curl xxx.sh and execute <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h4>
<div class="outline-text-4" id="text-org7736962">
<div class="org-src-container">
<pre class="src src-bash">curl https://xxx.sh | bash
</pre>
</div>
</div>
</div>

<div id="outline-container-org145031d" class="outline-4">
<h4 id="org145031d">Git: <a href="https://stackoverflow.com/questions/2227062/how-do-i-move-a-git-branch-out-into-its-own-repository">How do I move a Git branch out into its own repository? - Stack Overflow</a></h4>
</div>
<div id="outline-container-org9b7e823" class="outline-4">
<h4 id="org9b7e823">Lock-Free</h4>
<div class="outline-text-4" id="text-org9b7e823">
<p>
<a href="https://preshing.com/20120612/an-introduction-to-lock-free-programming/">An Introduction to Lock-Free Programming</a>
</p>

<p>
std::atomic 在 C 语言中可以通过 <code>volatile</code> 实现
</p>
</div>
</div>
<div id="outline-container-org4f26105" class="outline-4">
<h4 id="org4f26105">PUT 和 POST 的区别</h4>
<div class="outline-text-4" id="text-org4f26105">
<p>
<a href="https://www.w3.org/Protocols/rfc2616/rfc2616-sec9.html#sec9.6">HTTP/1.1: Method Definitions</a>
</p>
<blockquote>
<p>
   The fundamental difference between the POST and PUT requests is reflected in the different meaning of the Request-URI. The URI in a POST request identifies the resource that will handle the enclosed entity. That resource might be a data-accepting process, a gateway to some other protocol, or a separate entity that accepts annotations. In contrast, the URI in a PUT request identifies the entity enclosed with the request &#x2013; the user agent knows what URI is intended and the server MUST NOT attempt to apply the request to some other resource. If the server desires that the request be applied to a different URI,
it MUST send a 301 (Moved Permanently) response; the user agent MAY then make its own decision regarding whether or not to redirect the request.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgae23f65" class="outline-4">
<h4 id="orgae23f65">strongSwan 依赖</h4>
<div class="outline-text-4" id="text-orgae23f65">
<ul class="org-ul">
<li><p>
gperf
</p>
<div class="org-src-container">
<pre class="src src-sh">dnf --enablerepo=PowerTools install gperf
</pre>
</div></li>
<li><p>
gmp
</p>
<div class="org-src-container">
<pre class="src src-sh">yum install gmp-devel
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgdeab050" class="outline-4">
<h4 id="orgdeab050"><a href="https://zhuanlan.zhihu.com/p/137041568">如何系统地学习数据结构与算法？ - 知乎</a></h4>
</div>
<div id="outline-container-orgf378dd3" class="outline-4">
<h4 id="orgf378dd3">check threads</h4>
<div class="outline-text-4" id="text-orgf378dd3">
<p>
<a href="https://www.golinuxcloud.com/tutorial-linux-memory-management-overview/">4 commands to check thread count per process (threads vs processes) in Linux</a>
</p>
</div>
</div>
<div id="outline-container-orgc463a1d" class="outline-4">
<h4 id="orgc463a1d">rpm install with dependencies</h4>
<div class="outline-text-4" id="text-orgc463a1d">
<div class="org-src-container">
<pre class="src src-sh">yum --nogpgcheck localinstall xxx.rpm
</pre>
</div>
<p>
<a href="https://stackoverflow.com/questions/13876875/how-to-make-rpm-auto-install-dependencies">linux - How to make rpm auto install dependencies - Stack Overflow</a>
</p>
</div>
</div>
