NOTEs.org
*** gcc error when inline without static
    - [[https://www.geeksforgeeks.org/inline-function-in-c/][Inline function in C - GeeksforGeeks]]
    - [[https://stackoverflow.com/questions/22767523/what-inline-attribute-always-inline-means-in-the-function#22767621][c - what “inline __attribute__((always_inline))” means in the function? - Stack Overflow]]


    - ~inline~ only
      - C code:
        #+begin_src c
          #include <stdio.h>

          inline int func() { printf("dll\n"); }

          int main() { func(); }
        #+end_src
      - asm code:
        #+begin_src asm
              .section	__TEXT,__text,regular,pure_instructions
              .build_version macos, 11, 0	sdk_version 11, 1
              .globl	_main                   ## -- Begin function main
              .p2align	4, 0x90
            _main:                                  ## @main
              .cfi_startproc
            ## %bb.0:
              pushq	%rbp
              .cfi_def_cfa_offset 16
              .cfi_offset %rbp, -16
              movq	%rsp, %rbp
              .cfi_def_cfa_register %rbp
              subq	$16, %rsp
              callq	_func
              xorl	%ecx, %ecx
              movl	%eax, -4(%rbp)          ## 4-byte Spill
              movl	%ecx, %eax
              addq	$16, %rsp
              popq	%rbp
              retq
              .cfi_endproc
                                                    ## -- End function
            .subsections_via_symbols
        #+end_src
    - With ~static~
      - C code
        #+begin_src c
          #include <stdio.h>

          static inline int func() { printf("dll\n"); }

          int main() { func(); }
        #+end_src
      - asm code
        #+begin_src asm
            .section	__TEXT,__text,regular,pure_instructions
            .build_version macos, 11, 0	sdk_version 11, 1
            .globl	_main                   ## -- Begin function main
            .p2align	4, 0x90
          _main:                                  ## @main
            .cfi_startproc
          ## %bb.0:
            pushq	%rbp
            .cfi_def_cfa_offset 16
            .cfi_offset %rbp, -16
            movq	%rsp, %rbp
            .cfi_def_cfa_register %rbp
            subq	$16, %rsp
            callq	_func
            xorl	%ecx, %ecx
            movl	%eax, -4(%rbp)          ## 4-byte Spill
            movl	%ecx, %eax
            addq	$16, %rsp
            popq	%rbp
            retq
            .cfi_endproc
                                                  ## -- End function
            .p2align	4, 0x90         ## -- Begin function func
          _func:                                  ## @func
            .cfi_startproc
          ## %bb.0:
            pushq	%rbp
            .cfi_def_cfa_offset 16
            .cfi_offset %rbp, -16
            movq	%rsp, %rbp
            .cfi_def_cfa_register %rbp
            subq	$16, %rsp
            leaq	L_.str(%rip), %rdi
            movb	$0, %al
            callq	_printf
            movl	-4(%rbp), %ecx
            movl	%eax, -8(%rbp)          ## 4-byte Spill
            movl	%ecx, %eax
            addq	$16, %rsp
            popq	%rbp
            retq
            .cfi_endproc
                                                  ## -- End function
            .section	__TEXT,__cstring,cstring_literals
          L_.str:                                 ## @.str
            .asciz	"dll\n"

          .subsections_via_symbols
        #+end_src
    - With ~__attribute__~
      - C code
        #+begin_src c
          #include <stdio.h>

          #define inline __attribute__((alwyas_inline))

          inline int func() { printf("dll\n"); }

          int main() { func(); }
        #+end_src
      - asm code
        #+begin_src asm
            .section	__TEXT,__text,regular,pure_instructions
            .build_version macos, 11, 0	sdk_version 11, 1
            .globl	_func                   ## -- Begin function func
            .p2align	4, 0x90
          _func:                                  ## @func
            .cfi_startproc
          ## %bb.0:
            pushq	%rbp
            .cfi_def_cfa_offset 16
            .cfi_offset %rbp, -16
            movq	%rsp, %rbp
            .cfi_def_cfa_register %rbp
            subq	$16, %rsp
            leaq	L_.str(%rip), %rdi
            movb	$0, %al
            callq	_printf
            movl	-4(%rbp), %ecx
            movl	%eax, -8(%rbp)          ## 4-byte Spill
            movl	%ecx, %eax
            addq	$16, %rsp
            popq	%rbp
            retq
            .cfi_endproc
                                                  ## -- End function
            .globl	_main                   ## -- Begin function main
            .p2align	4, 0x90
          _main:                                  ## @main
            .cfi_startproc
          ## %bb.0:
            pushq	%rbp
            .cfi_def_cfa_offset 16
            .cfi_offset %rbp, -16
            movq	%rsp, %rbp
            .cfi_def_cfa_register %rbp
            subq	$16, %rsp
            callq	_func
            xorl	%ecx, %ecx
            movl	%eax, -4(%rbp)          ## 4-byte Spill
            movl	%ecx, %eax
            addq	$16, %rsp
            popq	%rbp
            retq
            .cfi_endproc
                                                  ## -- End function
            .section	__TEXT,__cstring,cstring_literals
          L_.str:                                 ## @.str
            .asciz	"dll\n"

          .subsections_via_symbols
        #+end_src

