NOTEs.html
<div id="outline-container-org85af063" class="outline-4">
<h4 id="org85af063">gcc error when inline without static</h4>
<div class="outline-text-4" id="text-org85af063">
<ul class="org-ul">
<li><a href="https://www.geeksforgeeks.org/inline-function-in-c/">Inline function in C - GeeksforGeeks</a></li>
<li><a href="https://stackoverflow.com/questions/22767523/what-inline-attribute-always-inline-means-in-the-function#22767621">c - what “inline __attribute__((always_inline))” means in the function? - Stack Overflow</a></li>
</ul>


<ul class="org-ul">
<li><code>inline</code> only
<ul class="org-ul">
<li><p>
C code:
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #4f97d7; font-weight: bold;">inline</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">func</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"dll\n"</span><span style="color: #bc6ec5;">)</span>; <span style="color: #4f97d7;">}</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> func<span style="color: #bc6ec5;">()</span>; <span style="color: #4f97d7;">}</span>
</pre>
</div></li>
<li><p>
asm code:
</p>
<div class="org-src-container">
<pre class="src src-asm">  <span style="color: #4f97d7; font-weight: bold;">.section</span>      __TEXT,__text,regular,pure_instructions
  <span style="color: #4f97d7; font-weight: bold;">.build_version</span> macos, 11, 0   sdk_version 11, 1
  <span style="color: #4f97d7; font-weight: bold;">.globl</span>        _main                   ## -- Begin function main
  <span style="color: #4f97d7; font-weight: bold;">.p2align</span>      4, 0x90
<span style="color: #bc6ec5; font-weight: bold;">_main</span>:                                  ## @main
  <span style="color: #4f97d7; font-weight: bold;">.cfi_startproc</span>
## <span style="color: #7590db;">%bb</span>.0:
  <span style="color: #4f97d7; font-weight: bold;">pushq</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_offset</span> 16
  <span style="color: #4f97d7; font-weight: bold;">.cfi_offset</span> <span style="color: #7590db;">%rbp</span>, -16
  <span style="color: #4f97d7; font-weight: bold;">movq</span>  <span style="color: #7590db;">%rsp</span>, <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_register</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">subq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">callq</span> _func
  <span style="color: #4f97d7; font-weight: bold;">xorl</span>  <span style="color: #7590db;">%ecx</span>, <span style="color: #7590db;">%ecx</span>
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%eax</span>, -4<span style="color: #4f97d7;">(</span><span style="color: #7590db;">%rbp</span><span style="color: #4f97d7;">)</span>          ## 4-byte Spill
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%ecx</span>, <span style="color: #7590db;">%eax</span>
  <span style="color: #4f97d7; font-weight: bold;">addq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">popq</span>  <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">retq</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_endproc</span>
                                        ## -- End function
<span style="color: #4f97d7; font-weight: bold;">.subsections_via_symbols</span>
</pre>
</div></li>
</ul></li>
<li>With <code>static</code>
<ul class="org-ul">
<li><p>
C code
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">inline</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">func</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"dll\n"</span><span style="color: #bc6ec5;">)</span>; <span style="color: #4f97d7;">}</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> func<span style="color: #bc6ec5;">()</span>; <span style="color: #4f97d7;">}</span>
</pre>
</div></li>
<li><p>
asm code
</p>
<div class="org-src-container">
<pre class="src src-asm">  <span style="color: #4f97d7; font-weight: bold;">.section</span>      __TEXT,__text,regular,pure_instructions
  <span style="color: #4f97d7; font-weight: bold;">.build_version</span> macos, 11, 0   sdk_version 11, 1
  <span style="color: #4f97d7; font-weight: bold;">.globl</span>        _main                   ## -- Begin function main
  <span style="color: #4f97d7; font-weight: bold;">.p2align</span>      4, 0x90
<span style="color: #bc6ec5; font-weight: bold;">_main</span>:                                  ## @main
  <span style="color: #4f97d7; font-weight: bold;">.cfi_startproc</span>
## <span style="color: #7590db;">%bb</span>.0:
  <span style="color: #4f97d7; font-weight: bold;">pushq</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_offset</span> 16
  <span style="color: #4f97d7; font-weight: bold;">.cfi_offset</span> <span style="color: #7590db;">%rbp</span>, -16
  <span style="color: #4f97d7; font-weight: bold;">movq</span>  <span style="color: #7590db;">%rsp</span>, <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_register</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">subq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">callq</span> _func
  <span style="color: #4f97d7; font-weight: bold;">xorl</span>  <span style="color: #7590db;">%ecx</span>, <span style="color: #7590db;">%ecx</span>
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%eax</span>, -4<span style="color: #4f97d7;">(</span><span style="color: #7590db;">%rbp</span><span style="color: #4f97d7;">)</span>          ## 4-byte Spill
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%ecx</span>, <span style="color: #7590db;">%eax</span>
  <span style="color: #4f97d7; font-weight: bold;">addq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">popq</span>  <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">retq</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_endproc</span>
                                        ## -- End function
  <span style="color: #4f97d7; font-weight: bold;">.p2align</span>      4, 0x90         ## -- Begin function func
<span style="color: #bc6ec5; font-weight: bold;">_func</span>:                                  ## @func
  <span style="color: #4f97d7; font-weight: bold;">.cfi_startproc</span>
## <span style="color: #7590db;">%bb</span>.0:
  <span style="color: #4f97d7; font-weight: bold;">pushq</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_offset</span> 16
  <span style="color: #4f97d7; font-weight: bold;">.cfi_offset</span> <span style="color: #7590db;">%rbp</span>, -16
  <span style="color: #4f97d7; font-weight: bold;">movq</span>  <span style="color: #7590db;">%rsp</span>, <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_register</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">subq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">leaq</span>  L_.str<span style="color: #4f97d7;">(</span><span style="color: #7590db;">%rip</span><span style="color: #4f97d7;">)</span>, <span style="color: #7590db;">%rdi</span>
  <span style="color: #4f97d7; font-weight: bold;">movb</span>  $0, <span style="color: #7590db;">%al</span>
  <span style="color: #4f97d7; font-weight: bold;">callq</span> _printf
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  -4<span style="color: #4f97d7;">(</span><span style="color: #7590db;">%rbp</span><span style="color: #4f97d7;">)</span>, <span style="color: #7590db;">%ecx</span>
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%eax</span>, -8<span style="color: #4f97d7;">(</span><span style="color: #7590db;">%rbp</span><span style="color: #4f97d7;">)</span>          ## 4-byte Spill
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%ecx</span>, <span style="color: #7590db;">%eax</span>
  <span style="color: #4f97d7; font-weight: bold;">addq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">popq</span>  <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">retq</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_endproc</span>
                                        ## -- End function
  <span style="color: #4f97d7; font-weight: bold;">.section</span>      __TEXT,__cstring,cstring_literals
<span style="color: #bc6ec5; font-weight: bold;">L</span>_.str:                                 ## @.str
  <span style="color: #4f97d7; font-weight: bold;">.asciz</span>        <span style="color: #2d9574;">"dll\n"</span>

<span style="color: #4f97d7; font-weight: bold;">.subsections_via_symbols</span>
</pre>
</div></li>
</ul></li>
<li>With <code>__attribute__</code>
<ul class="org-ul">
<li><p>
C code
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #bc6ec5;">#define</span> <span style="color: #7590db;">inline</span> <span style="color: #4f97d7; font-weight: bold;">__attribute__</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>alwyas_inline<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">inline</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">func</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"dll\n"</span><span style="color: #bc6ec5;">)</span>; <span style="color: #4f97d7;">}</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span> func<span style="color: #bc6ec5;">()</span>; <span style="color: #4f97d7;">}</span>
</pre>
</div></li>
<li><p>
asm code
</p>
<div class="org-src-container">
<pre class="src src-asm">  <span style="color: #4f97d7; font-weight: bold;">.section</span>      __TEXT,__text,regular,pure_instructions
  <span style="color: #4f97d7; font-weight: bold;">.build_version</span> macos, 11, 0   sdk_version 11, 1
  <span style="color: #4f97d7; font-weight: bold;">.globl</span>        _func                   ## -- Begin function func
  <span style="color: #4f97d7; font-weight: bold;">.p2align</span>      4, 0x90
<span style="color: #bc6ec5; font-weight: bold;">_func</span>:                                  ## @func
  <span style="color: #4f97d7; font-weight: bold;">.cfi_startproc</span>
## <span style="color: #7590db;">%bb</span>.0:
  <span style="color: #4f97d7; font-weight: bold;">pushq</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_offset</span> 16
  <span style="color: #4f97d7; font-weight: bold;">.cfi_offset</span> <span style="color: #7590db;">%rbp</span>, -16
  <span style="color: #4f97d7; font-weight: bold;">movq</span>  <span style="color: #7590db;">%rsp</span>, <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_register</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">subq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">leaq</span>  L_.str<span style="color: #4f97d7;">(</span><span style="color: #7590db;">%rip</span><span style="color: #4f97d7;">)</span>, <span style="color: #7590db;">%rdi</span>
  <span style="color: #4f97d7; font-weight: bold;">movb</span>  $0, <span style="color: #7590db;">%al</span>
  <span style="color: #4f97d7; font-weight: bold;">callq</span> _printf
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  -4<span style="color: #4f97d7;">(</span><span style="color: #7590db;">%rbp</span><span style="color: #4f97d7;">)</span>, <span style="color: #7590db;">%ecx</span>
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%eax</span>, -8<span style="color: #4f97d7;">(</span><span style="color: #7590db;">%rbp</span><span style="color: #4f97d7;">)</span>          ## 4-byte Spill
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%ecx</span>, <span style="color: #7590db;">%eax</span>
  <span style="color: #4f97d7; font-weight: bold;">addq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">popq</span>  <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">retq</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_endproc</span>
                                        ## -- End function
  <span style="color: #4f97d7; font-weight: bold;">.globl</span>        _main                   ## -- Begin function main
  <span style="color: #4f97d7; font-weight: bold;">.p2align</span>      4, 0x90
<span style="color: #bc6ec5; font-weight: bold;">_main</span>:                                  ## @main
  <span style="color: #4f97d7; font-weight: bold;">.cfi_startproc</span>
## <span style="color: #7590db;">%bb</span>.0:
  <span style="color: #4f97d7; font-weight: bold;">pushq</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_offset</span> 16
  <span style="color: #4f97d7; font-weight: bold;">.cfi_offset</span> <span style="color: #7590db;">%rbp</span>, -16
  <span style="color: #4f97d7; font-weight: bold;">movq</span>  <span style="color: #7590db;">%rsp</span>, <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_def_cfa_register</span> <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">subq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">callq</span> _func
  <span style="color: #4f97d7; font-weight: bold;">xorl</span>  <span style="color: #7590db;">%ecx</span>, <span style="color: #7590db;">%ecx</span>
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%eax</span>, -4<span style="color: #4f97d7;">(</span><span style="color: #7590db;">%rbp</span><span style="color: #4f97d7;">)</span>          ## 4-byte Spill
  <span style="color: #4f97d7; font-weight: bold;">movl</span>  <span style="color: #7590db;">%ecx</span>, <span style="color: #7590db;">%eax</span>
  <span style="color: #4f97d7; font-weight: bold;">addq</span>  $16, <span style="color: #7590db;">%rsp</span>
  <span style="color: #4f97d7; font-weight: bold;">popq</span>  <span style="color: #7590db;">%rbp</span>
  <span style="color: #4f97d7; font-weight: bold;">retq</span>
  <span style="color: #4f97d7; font-weight: bold;">.cfi_endproc</span>
                                        ## -- End function
  <span style="color: #4f97d7; font-weight: bold;">.section</span>      __TEXT,__cstring,cstring_literals
<span style="color: #bc6ec5; font-weight: bold;">L</span>_.str:                                 ## @.str
  <span style="color: #4f97d7; font-weight: bold;">.asciz</span>        <span style="color: #2d9574;">"dll\n"</span>

<span style="color: #4f97d7; font-weight: bold;">.subsections_via_symbols</span>
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
