NOTEs.org
*** [[https://stackoverflow.com/questions/4605842/how-to-identify-platform-compiler-from-preprocessor-macros#4605893][c++ - How to identify platform/compiler from preprocessor macros? - Stack Overflow]]
    #+begin_src c
      #ifdef __APPLE__
      /* Mac OS */
      #endif

      #ifdef __MINGW32__
      /* MingW on Windows */
      #endif  // __MINGW32__

      #ifdef _WIN32
      /* Windows */
      #endif  // _WIN32

      #ifdef __linux__
      /* Linux */
      #endif  // __linux__
    #+end_src
*** valgrind messages
    [[https://epitech-2022-technical-documentation.readthedocs.io/en/latest/valgrind.html][Debug : Understanding Valgrind’s messages — EPITECH 2022 - Technical Documentation 1.3.38 documentation]]
*** mysql C API: still reachable
    call ~mysql_library_end()~ after ~mysql_close()~
*** gdb 打印数组
    =p *array@len=
    [[https://www.sourceware.org/gdb/onlinedocs/gdb/Arrays.html][Arrays (Debugging with GDB)]]
*** recover/undo/get back deleted commit (even remote)
    - [[https://stackoverflow.com/questions/1992364/git-recover-deleted-remote-branch][github - Git: Recover deleted (remote) branch - Stack Overflow]]
      #+begin_src sh
        git fsck --full --no-reflogs | grep commit
      #+end_src
*** [[https://stackoverflow.com/questions/8220098/how-to-redirect-the-output-of-an-application-in-background-to-dev-null#8220110][linux - How to redirect the output of an application in background to /dev/null - Stack Overflow]]
    #+begin_src sh
      cmd >/dev/null 2&>1 &
    #+end_src
*** [[https://dev.to/lydiahallie/cs-visualized-useful-git-commands-37p1#merge][CS Visualized: Useful Git Commands - DEV]]
*** slice an array in bash
    [[https://stackoverflow.com/questions/1335815/how-to-slice-an-array-in-bash][How to slice an array in Bash - Stack Overflow]]
    =${@:3:8}=
*** gcc expand macros
    [[https://stackoverflow.com/questions/985403/seeing-expanded-c-macros][c preprocessor - Seeing expanded C macros - Stack Overflow]]
*** =sed=: How to use variables in =sed=
    #+begin_src sh
      sed -i 's|aaa|${variable}|g' Makefile
    #+end_src
    [[https://stackoverflow.com/questions/19151954/how-to-use-variables-in-a-command-in-sed][unix - How to use variables in a command in sed? - Stack Overflow]]
*** Ubuntu: How to disable FireWall
    #+begin_src sh
      sudo ufw disable
    #+end_src
*** Git delete remote branch
    #+begin_src sh
      git push origin -d feature
    #+end_src
*** Makefile for Kenel module
    [[https://stackoverflow.com/questions/60252681/how-to-write-a-linux-kernel-module-makefile][How to write a Linux kernel module makefile? - Stack Overflow]]
*** Get client sock IP addr
    [[https://stackoverflow.com/questions/3060950/how-to-get-ip-address-from-sock-structure-in-c][sockets - How to get ip address from sock structure in c? - Stack Overflow]]
*** Mac 清理右键多余选单
    #+begin_src sh
      /System/Library/Frameworks/CoreServices.framework/Frameworks/LaunchServices.framework/Support/lsregister -kill -r -domain local -domain system -domain user
    #+end_src
*** differences between preprocessor and =inline=
    [[https://stackoverflow.com/questions/1137575/inline-functions-vs-preprocessor-macros][c++ - Inline functions vs Preprocessor macros - Stack Overflow]]
*** =w !sudo tee %= principle
    [[https://unix.stackexchange.com/questions/301256/how-does-w-sudo-tee-work][vim - How does `:w !sudo tee %` work - Unix & Linux Stack Exchange]]
*** Figure out the largest directory
    #+begin_src bash
      du -sh * | gsort -h
    #+end_src
*** ~long~ 和 ~long long~ 的区别
    在 64bit OS X 和 64bit Linux 上没有区别
    #+begin_src c
      #include <limits.h>
      #include <stdio.h>

      int main() {
          printf("sizeof(long): %lu\n",  sizeof(long));
          printf("sizeof(llong): %lu\n", sizeof(long long));
          printf("LONG_MAX: %ld\n",      LONG_MAX);
          printf("LONG_MIN: %ld\n",      LONG_MIN);
          printf("LLONG_MAX: %lld\n",    LLONG_MAX);
          printf("LLONG_MIN: %lld\n",    LLONG_MIN);
      }
    #+end_src
*** 删除特殊符号的文件名
    #+begin_src sh
      rm -- filename
    #+end_src
