NOTEs.html

<div id="outline-container-org6586e53" class="outline-4">
<h4 id="org6586e53"><a href="https://stackoverflow.com/questions/4605842/how-to-identify-platform-compiler-from-preprocessor-macros#4605893">c++ - How to identify platform/compiler from preprocessor macros? - Stack Overflow</a></h4>
<div class="outline-text-4" id="text-org6586e53">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#ifdef</span> __APPLE__
<span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">Mac OS</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #bc6ec5;">#endif</span>

<span style="color: #bc6ec5;">#ifdef</span> __MINGW32__
<span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">MingW on Windows</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #bc6ec5;">#endif</span>  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">__MINGW32__</span>

<span style="color: #bc6ec5;">#ifdef</span> _WIN32
<span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">Windows</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #bc6ec5;">#endif</span>  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">_WIN32</span>

<span style="color: #bc6ec5;">#ifdef</span> __linux__
<span style="color: #2aa1ae; background-color: #292e34;">/* </span><span style="color: #2aa1ae; background-color: #292e34;">Linux</span><span style="color: #2aa1ae; background-color: #292e34;"> */</span>
<span style="color: #bc6ec5;">#endif</span>  <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">__linux__</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org490a6bb" class="outline-4">
<h4 id="org490a6bb">valgrind messages</h4>
<div class="outline-text-4" id="text-org490a6bb">
<p>
<a href="https://epitech-2022-technical-documentation.readthedocs.io/en/latest/valgrind.html">Debug : Understanding Valgrind’s messages — EPITECH 2022 - Technical Documentation 1.3.38 documentation</a>
</p>
</div>
</div>
<div id="outline-container-org308598f" class="outline-4">
<h4 id="org308598f">mysql C API: still reachable</h4>
<div class="outline-text-4" id="text-org308598f">
<p>
call <code>mysql_library_end()</code> after <code>mysql_close()</code>
</p>
</div>
</div>
<div id="outline-container-orgd58ac1d" class="outline-4">
<h4 id="orgd58ac1d">gdb 打印数组</h4>
<div class="outline-text-4" id="text-orgd58ac1d">
<p>
<code>p *array@len</code>
<a href="https://www.sourceware.org/gdb/onlinedocs/gdb/Arrays.html">Arrays (Debugging with GDB)</a>
</p>
</div>
</div>
<div id="outline-container-orga6b3b3b" class="outline-4">
<h4 id="orga6b3b3b">recover/undo/get back deleted commit (even remote)</h4>
<div class="outline-text-4" id="text-orga6b3b3b">
<ul class="org-ul">
<li><p>
<a href="https://stackoverflow.com/questions/1992364/git-recover-deleted-remote-branch">github - Git: Recover deleted (remote) branch - Stack Overflow</a>
</p>
<div class="org-src-container">
<pre class="src src-sh">git fsck --full --no-reflogs | grep commit
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org4a69536" class="outline-4">
<h4 id="org4a69536"><a href="https://stackoverflow.com/questions/8220098/how-to-redirect-the-output-of-an-application-in-background-to-dev-null#8220110">linux - How to redirect the output of an application in background to /dev/null - Stack Overflow</a></h4>
<div class="outline-text-4" id="text-org4a69536">
<div class="org-src-container">
<pre class="src src-sh">cmd &gt;/dev/null <span style="color: #a45bad;">2</span>&amp;&gt;<span style="color: #a45bad;">1</span> &amp;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgda32ced" class="outline-4">
<h4 id="orgda32ced"><a href="https://dev.to/lydiahallie/cs-visualized-useful-git-commands-37p1#merge">CS Visualized: Useful Git Commands - DEV</a></h4>
</div>
<div id="outline-container-org263b287" class="outline-4">
<h4 id="org263b287">slice an array in bash</h4>
<div class="outline-text-4" id="text-org263b287">
<p>
<a href="https://stackoverflow.com/questions/1335815/how-to-slice-an-array-in-bash">How to slice an array in Bash - Stack Overflow</a>
<code>${@:3:8}</code>
</p>
</div>
</div>
<div id="outline-container-org52cd746" class="outline-4">
<h4 id="org52cd746">gcc expand macros</h4>
<div class="outline-text-4" id="text-org52cd746">
<p>
<a href="https://stackoverflow.com/questions/985403/seeing-expanded-c-macros">c preprocessor - Seeing expanded C macros - Stack Overflow</a>
</p>
</div>
</div>
<div id="outline-container-org620f377" class="outline-4">
<h4 id="org620f377"><code>sed</code>: How to use variables in <code>sed</code></h4>
<div class="outline-text-4" id="text-org620f377">
<div class="org-src-container">
<pre class="src src-sh">sed -i <span style="color: #2d9574;">'s|aaa|${variable}|g'</span> Makefile e
</pre>
</div>
<p>
<a href="https://stackoverflow.com/questions/19151954/how-to-use-variables-in-a-command-in-sed">unix - How to use variables in a command in sed? - Stack Overflow</a>
</p>
</div>
</div>
<div id="outline-container-orgba297fa" class="outline-4">
<h4 id="orgba297fa">Ubuntu: How to disable FireWall</h4>
<div class="outline-text-4" id="text-orgba297fa">
<div class="org-src-container">
<pre class="src src-sh">sudo ufw disable
</pre>
</div>
</div>
</div>
<div id="outline-container-org08587f9" class="outline-4">
<h4 id="org08587f9">Git delete remote branch</h4>
<div class="outline-text-4" id="text-org08587f9">
<div class="org-src-container">
<pre class="src src-sh">git push origin -d feature
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf97e469" class="outline-4">
<h4 id="orgf97e469">Makefile for Kenel module</h4>
<div class="outline-text-4" id="text-orgf97e469">
<p>
<a href="https://stackoverflow.com/questions/60252681/how-to-write-a-linux-kernel-module-makefile">How to write a Linux kernel module makefile? - Stack Overflow</a>
</p>
</div>
</div>
<div id="outline-container-org41cab78" class="outline-4">
<h4 id="org41cab78">Get client sock IP addr</h4>
<div class="outline-text-4" id="text-org41cab78">
<p>
<a href="https://stackoverflow.com/questions/3060950/how-to-get-ip-address-from-sock-structure-in-c">sockets - How to get ip address from sock structure in c? - Stack Overflow</a>
</p>
</div>
</div>
<div id="outline-container-orgbfbc548" class="outline-4">
<h4 id="orgbfbc548">Mac 清理右键多余选单</h4>
<div class="outline-text-4" id="text-orgbfbc548">
<div class="org-src-container">
<pre class="src src-sh">/System/Library/Frameworks/CoreServices.framework/Frameworks/LaunchServices.framework/Support/lsregister -kill -r -domain local -domain system -domain user
</pre>
</div>
</div>
</div>
<div id="outline-container-org230e9cb" class="outline-4">
<h4 id="org230e9cb">differences between preprocessor and <code>inline</code></h4>
<div class="outline-text-4" id="text-org230e9cb">
<p>
<a href="https://stackoverflow.com/questions/1137575/inline-functions-vs-preprocessor-macros">c++ - Inline functions vs Preprocessor macros - Stack Overflow</a>
</p>
</div>
</div>
<div id="outline-container-org6235a27" class="outline-4">
<h4 id="org6235a27"><code>w !sudo tee %</code> principle</h4>
<div class="outline-text-4" id="text-org6235a27">
<p>
<a href="https://unix.stackexchange.com/questions/301256/how-does-w-sudo-tee-work">vim - How does `:w !sudo tee %` work - Unix &amp; Linux Stack Exchange</a>
</p>
</div>
</div>
<div id="outline-container-orgfe01a0b" class="outline-4">
<h4 id="orgfe01a0b">Figure out the largest directory</h4>
<div class="outline-text-4" id="text-orgfe01a0b">
<div class="org-src-container">
<pre class="src src-bash">du -sh * | gsort -h
</pre>
</div>
</div>
</div>
<div id="outline-container-org8f47717" class="outline-4">
<h4 id="org8f47717"><code>long</code> 和 <code>long long</code> 的区别</h4>
<div class="outline-text-4" id="text-org8f47717">
<p>
在 64bit OS X 和 64bit Linux 上没有区别
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">limits.h</span><span style="color: #4f97d7;">&gt;</span>
<span style="color: #bc6ec5;">#include</span> <span style="color: #4f97d7;">&lt;</span><span style="color: #2d9574;">stdio.h</span><span style="color: #4f97d7;">&gt;</span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"sizeof(long): %lu\n"</span>,  <span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">long</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"sizeof(llong): %lu\n"</span>, <span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">long</span> <span style="color: #ce537a; font-weight: bold;">long</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"LONG_MAX: %ld\n"</span>,      LONG_MAX<span style="color: #bc6ec5;">)</span>;
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"LONG_MIN: %ld\n"</span>,      LONG_MIN<span style="color: #bc6ec5;">)</span>;
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"LLONG_MAX: %lld\n"</span>,    LLONG_MAX<span style="color: #bc6ec5;">)</span>;
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"LLONG_MIN: %lld\n"</span>,    LLONG_MIN<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
