NOTEs.org
*** 通过 Netfilter 自写模块实现过滤器
    - [[https://www.netfilter.org/documentation/HOWTO/netfilter-hacking-HOWTO-3.html][Linux netfilter Hacking HOWTO: Netfilter Architecture]]
    - [[https://www.cnblogs.com/tzh36/p/5424564.html][Linux内核：sk_buff 解析 - 唐稚骅 - 博客园]]
    - [[https://www.cnblogs.com/codestack/p/10850642.html][linux netfilter 五个钩子点 - codestacklinuxer - 博客园]]
    - [[https://www.frozentux.net/iptables-tutorial/cn/iptables-tutorial-cn-1.1.19.html#TRAVERSINGOFTABLES][Iptables 指南 1.1.19]]
    - [[https://stackoverflow.com/questions/42385002/how-to-get-payload-from-struct-sk-buff-in-netfilter-kernel-module-linux][c - How to get payload from struct sk_buff in netfilter kernel module linux - Stack Overflow]]
*** nginx: urlencded url not found
    #+begin_src nginx
      rewrite ^/(.*)$         /$1    break;
    #+end_src
*** 数据结构
**** 使用加法判断循环队列
     #+begin_src c
       if ((tail + 1) % size == head) {
           printf("cycle queue is full");
       }
     #+end_src
*** MySQL
**** QA
     - Q: [[https://stackoverflow.com/questions/61649764/mysql-error-2026-ssl-connection-error-ubuntu-20-04][django - MySQL ERROR 2026 - SSL connection error - Ubuntu 20.04 - Stack Overflow]]
     - A:
       #+begin_quote
       [mysqld]
       tls_version=TLSv1.2
       #+end_quote
     - Q: [[https://stackoverflow.com/questions/1676551/best-way-to-test-if-a-row-exists-in-a-mysql-table/10688065#10688065][sql - Best way to test if a row exists in a MySQL table - Stack Overflow]]
     - A:
       #+begin_src sql
         SELECT EXISTS(SELECT * FROM table1 WHERE ...)
       #+end_src

     - Q: [[https://stackoverflow.com/questions/20116140/change-unique-key-together-in-mysql][Change unique key together in mysql - Stack Overflow]]
     - A:
       #+begin_src sql
         ALTER TABLE your_table
           DROP INDEX user_id,
           ADD UNIQUE KEY `user_id` (`user_id`,`account_id`,`pet_id`)
       #+end_src

     - Q: ERROR 1130 (HY000): Host '192.168.253.140' is not allowed to connect to this MySQL server
     - A:
       #+begin_src sql
         CREATE USER 'root'@'%' IDENTIFIED BY '';
         GRANT ALL PRIVILEGES ON *.* TO 'root'@'%' WITH GRANT OPTION;
         FLUSH PRIVILEGES;
       #+end_src
       #+begin_src bash
         vim my.cnf
         [mysqld]
         bind-address=*
       #+end_src

     - Q: ERROR 1805 (HY000): Column count of mysql.user is wrong. Expected 45, found 48. The table is probably corrupted
     - A: =mysql_upgrade -u root --force=

     - Q: Alter a column to be AUTO_INCREMENT
     - A:
       #+begin_src sql
         ALTER TABLE document
           MODIFY COLUMN document_id AUTO_INCREMENT;
       #+end_src

     - Q: INSERT data to MYSQL without specifying AUTO_INCREMENT column names;
     - A:
       #+begin_src sql
         INSERT INTO table VALUES (NULL, value1, value2);
       #+end_src

     - Q: reset AUTO_INCREMENT
     - A:
       #+begin_src sql
         ALTER TABLE table AUTO_INCREMENT = 1;
       #+end_src

     - Q: truncate multiple tables;
     - A:
       #+begin_src sql
         SELECT CONCAT('TRUNCATE TABLE', TABLE_NAME, '; ') FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_SCHEMA = 'db_name' AND TABLE_NAME LIKE 'pre_%';
       #+end_src
     - Q: ERROR 2002 (HY000): Can't connect to MySQL server on '192.168.254.20' (36)
     - A:
       #+begin_src bash
         firewall-cmd --zone=public --add-port=3306/tcp --permanent
         systemctl restart firewalld.service
       #+end_src
     - Q: ~ALTER TABLE~
     - A:
       #+begin_src sql
         ALTER TABLE tablename ADD/MODIFY/DROP COLUMN columnname TYPE
       #+end_src
*** BASH
**** if 语句: [[https://www.tldp.org/LDP/Bash-Beginners-Guide/html/sect_07_01.html][Introduction to if]]
**** 文件名带空格
     * Q: C print chinese erro \\
       A:
       #+begin_src sh
         gcc -fexec-charset=UTF-8
       #+end_src

     * Q: ~find~, ~xargs~  \\
       A: ~-print0~
       #+begin_src sh
         find ./ -name '*.bak' -print0 | xargs -0 rm -rf
       #+end_src
     * Q: ~grep~ \\
       A: ~-lZ~
     #+begin_src sh
       grep "long" C*.txt -lZ | xargs -0 ls -l
     #+end_src
     * Q: ~xargs~ result as source dir \\
       A: ~-I {}~
       [[https://askubuntu.com/questions/487035/mv-files-with-xargs][command line - mv files with | xargs - Ask Ubuntu]]
     #+begin_src sh
       find . -maxdepth 1 -type f | sudo xargs -I {} mv {} /etc/apache2/sites-available/
     #+end_src
*** ~Centos~
    * Q: ~build essential~ \\
      A: ~yum install groupinstall "Development Tools"~
