NOTEs.html
<div id="outline-container-orgc663b2d" class="outline-4">
<h4 id="orgc663b2d">删除特殊符号的文件名</h4>
<div class="outline-text-4" id="text-orgc663b2d">
<div class="org-src-container">
<pre class="src src-sh">rm -- filename
</pre>
</div>
</div>
</div>
<div id="outline-container-orge9b7a57" class="outline-4">
<h4 id="orge9b7a57">通过 Netfilter 自写模块实现过滤器</h4>
<div class="outline-text-4" id="text-orge9b7a57">
<ul class="org-ul">
<li><a href="https://www.netfilter.org/documentation/HOWTO/netfilter-hacking-HOWTO-3.html">Linux netfilter Hacking HOWTO: Netfilter Architecture</a></li>
<li><a href="https://www.cnblogs.com/tzh36/p/5424564.html">Linux内核：sk_buff 解析 - 唐稚骅 - 博客园</a></li>
<li><a href="https://www.cnblogs.com/codestack/p/10850642.html">linux netfilter 五个钩子点 - codestacklinuxer - 博客园</a></li>
<li><a href="https://www.frozentux.net/iptables-tutorial/cn/iptables-tutorial-cn-1.1.19.html#TRAVERSINGOFTABLES">Iptables 指南 1.1.19</a></li>
<li><a href="https://stackoverflow.com/questions/42385002/how-to-get-payload-from-struct-sk-buff-in-netfilter-kernel-module-linux">c - How to get payload from struct sk_buff in netfilter kernel module linux - Stack Overflow</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgde85f24" class="outline-4">
<h4 id="orgde85f24">nginx: urlencded url not found</h4>
<div class="outline-text-4" id="text-orgde85f24">
<div class="org-src-container">
<pre class="src src-nginx"><span style="color: #4f97d7; font-weight: bold;">rewrite</span> ^/<span style="color: #4f97d7;">(</span>.*<span style="color: #4f97d7;">)</span>$         /<span style="color: #a45bad;">$1</span>    <span style="color: #bc6ec5; font-weight: bold;">break</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orge319090" class="outline-4">
<h4 id="orge319090">数据结构</h4>
<div class="outline-text-4" id="text-orge319090">
</div>
<ul class="org-ul">
<li><a id="org258d4d2"></a>使用加法判断循环队列<br />
<div class="outline-text-5" id="text-org258d4d2">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>tail + <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span> % size == head<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    printf<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"cycle queue is full"</span><span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org3a1915a" class="outline-4">
<h4 id="org3a1915a">MySQL</h4>
<div class="outline-text-4" id="text-org3a1915a">
</div>
<ul class="org-ul">
<li><a id="orgec2a208"></a>QA<br />
<div class="outline-text-5" id="text-orgec2a208">
<ul class="org-ul">
<li>Q: <a href="https://stackoverflow.com/questions/61649764/mysql-error-2026-ssl-connection-error-ubuntu-20-04">django - MySQL ERROR 2026 - SSL connection error - Ubuntu 20.04 - Stack Overflow</a></li>
<li><p>
A:
</p>
<blockquote>
<p>
[mysqld]
tls_version=TLSv1.2
</p>
</blockquote></li>
<li>Q: <a href="https://stackoverflow.com/questions/1676551/best-way-to-test-if-a-row-exists-in-a-mysql-table/10688065#10688065">sql - Best way to test if a row exists in a MySQL table - Stack Overflow</a></li>
<li><p>
A:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">SELECT</span> <span style="color: #4f97d7; font-weight: bold;">EXISTS</span>(<span style="color: #4f97d7; font-weight: bold;">SELECT</span> * <span style="color: #4f97d7;">FROM</span> table1 <span style="color: #4f97d7; font-weight: bold;">WHERE</span> ...)
</pre>
</div></li>

<li>Q: <a href="https://stackoverflow.com/questions/20116140/change-unique-key-together-in-mysql">Change unique key together in mysql - Stack Overflow</a></li>
<li><p>
A:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">ALTER</span> <span style="color: #4f97d7; font-weight: bold;">TABLE</span> <span style="color: #bc6ec5; font-weight: bold;">your_table</span>
  <span style="color: #4f97d7; font-weight: bold;">DROP</span> <span style="color: #4f97d7; font-weight: bold;">INDEX</span> user_id,
  <span style="color: #4f97d7; font-weight: bold;">ADD</span> <span style="color: #4f97d7; font-weight: bold;">UNIQUE</span> <span style="color: #4f97d7; font-weight: bold;">KEY</span> `user_id` (`user_id`,`account_id`,`pet_id`)
</pre>
</div></li>

<li>Q: ERROR 1130 (HY000): Host '192.168.253.140' is not allowed to connect to this MySQL server</li>
<li><p>
A:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">CREATE</span> <span style="color: #4f97d7;">USER</span> <span style="color: #2d9574;">'root'</span>@<span style="color: #2d9574;">'%'</span> IDENTIFIED <span style="color: #4f97d7; font-weight: bold;">BY</span> <span style="color: #2d9574;">''</span>;
<span style="color: #4f97d7; font-weight: bold;">GRANT</span> <span style="color: #4f97d7; font-weight: bold;">ALL</span> <span style="color: #4f97d7; font-weight: bold;">PRIVILEGES</span> <span style="color: #4f97d7; font-weight: bold;">ON</span> *.* <span style="color: #4f97d7; font-weight: bold;">TO</span> <span style="color: #2d9574;">'root'</span>@<span style="color: #2d9574;">'%'</span> <span style="color: #4f97d7; font-weight: bold;">WITH</span> <span style="color: #4f97d7; font-weight: bold;">GRANT</span> <span style="color: #4f97d7; font-weight: bold;">OPTION</span>;
FLUSH <span style="color: #4f97d7; font-weight: bold;">PRIVILEGES</span>;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-bash">vim my.cnf
<span style="color: #4f97d7;">[</span>mysqld<span style="color: #4f97d7;">]</span>
bind-address=*
</pre>
</div></li>

<li>Q: ERROR 1805 (HY000): Column count of mysql.user is wrong. Expected 45, found 48. The table is probably corrupted</li>
<li>A: <code>mysql_upgrade -u root --force</code></li>

<li>Q: Alter a column to be AUTO_INCREMENT</li>
<li><p>
A:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">ALTER</span> <span style="color: #4f97d7; font-weight: bold;">TABLE</span> <span style="color: #bc6ec5; font-weight: bold;">document</span>
  <span style="color: #4f97d7; font-weight: bold;">MODIFY</span> <span style="color: #4f97d7; font-weight: bold;">COLUMN</span> document_id <span style="color: #4f97d7; font-weight: bold;">AUTO_INCREMENT</span>;
</pre>
</div></li>

<li>Q: INSERT data to MYSQL without specifying AUTO_INCREMENT column names;</li>
<li><p>
A:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">INSERT</span> <span style="color: #4f97d7; font-weight: bold;">INTO</span> <span style="color: #4f97d7; font-weight: bold;">table</span> <span style="color: #4f97d7; font-weight: bold;">VALUES</span> (<span style="color: #4f97d7; font-weight: bold;">NULL</span>, value1, value2);
</pre>
</div></li>

<li>Q: reset AUTO_INCREMENT</li>
<li><p>
A:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">ALTER</span> <span style="color: #4f97d7; font-weight: bold;">TABLE</span> <span style="color: #4f97d7; font-weight: bold;">table</span> <span style="color: #4f97d7; font-weight: bold;">AUTO_INCREMENT</span> = 1;
</pre>
</div></li>

<li>Q: truncate multiple tables;</li>
<li><p>
A:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">SELECT</span> <span style="color: #4f97d7;">CONCAT</span>(<span style="color: #2d9574;">'TRUNCATE TABLE'</span>, <span style="color: #4f97d7; font-weight: bold;">TABLE_NAME</span>, <span style="color: #2d9574;">'; '</span>) <span style="color: #4f97d7;">FROM</span> INFORMATION_SCHEMA.<span style="color: #4f97d7; font-weight: bold;">TABLES</span> <span style="color: #4f97d7; font-weight: bold;">WHERE</span> TABLE_SCHEMA = <span style="color: #2d9574;">'db_name'</span> <span style="color: #4f97d7; font-weight: bold;">AND</span> <span style="color: #4f97d7; font-weight: bold;">TABLE_NAME</span> <span style="color: #4f97d7; font-weight: bold;">LIKE</span> <span style="color: #2d9574;">'pre_%'</span>;
</pre>
</div></li>
<li>Q: ERROR 2002 (HY000): Can't connect to MySQL server on '192.168.254.20' (36)</li>
<li><p>
A:
</p>
<div class="org-src-container">
<pre class="src src-bash">firewall-cmd --zone=public --add-port=<span style="color: #a45bad;">3306/tcp</span> --permanent
systemctl restart firewalld.service
</pre>
</div></li>
<li>Q: <code>ALTER TABLE</code></li>
<li><p>
A:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">ALTER</span> <span style="color: #4f97d7; font-weight: bold;">TABLE</span> <span style="color: #bc6ec5; font-weight: bold;">tablename</span> <span style="color: #4f97d7; font-weight: bold;">ADD</span>/<span style="color: #4f97d7; font-weight: bold;">MODIFY</span>/<span style="color: #4f97d7; font-weight: bold;">DROP</span> <span style="color: #4f97d7; font-weight: bold;">COLUMN</span> columnname <span style="color: #4f97d7; font-weight: bold;">TYPE</span>
</pre>
</div></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org19c02ca" class="outline-4">
<h4 id="org19c02ca">BASH</h4>
<div class="outline-text-4" id="text-org19c02ca">
</div>
<ul class="org-ul">
<li><a id="org7322845"></a>if 语句: <a href="https://www.tldp.org/LDP/Bash-Beginners-Guide/html/sect_07_01.html">Introduction to if</a><br /></li>
<li><a id="org86de855"></a>文件名带空格<br />
<div class="outline-text-5" id="text-org86de855">
<ul class="org-ul">
<li><p>
Q: C print chinese erro <br />
A:
</p>
<div class="org-src-container">
<pre class="src src-sh">gcc -fexec-charset=UTF-8
</pre>
</div></li>

<li><p>
Q: <code>find</code>, <code>xargs</code>  <br />
A: <code>-print0</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">find ./ -name <span style="color: #2d9574;">'*.bak'</span> -print0 | xargs -0 rm -rf
</pre>
</div></li>
<li>Q: <code>grep</code> <br />
A: <code>-lZ</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">grep <span style="color: #2d9574;">"long"</span> C*.txt -lZ | xargs -0 ls -l
</pre>
</div>
<ul class="org-ul">
<li>Q: <code>xargs</code> result as source dir <br />
A: <code>-I {}</code>
<a href="https://askubuntu.com/questions/487035/mv-files-with-xargs">command line - mv files with | xargs - Ask Ubuntu</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">find . -maxdepth <span style="color: #a45bad;">1</span> -type f | sudo xargs -I <span style="color: #4f97d7;">{}</span> mv <span style="color: #4f97d7;">{}</span> /etc/apache2/sites-available/
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org4561e8f" class="outline-4">
<h4 id="org4561e8f"><code>Centos</code></h4>
<div class="outline-text-4" id="text-org4561e8f">
<ul class="org-ul">
<li>Q: <code>build essential</code> <br />
A: <code>yum install groupinstall "Development Tools"</code></li>
</ul>
</div>
</div>
