NOTEs.org
*** ~segfault at 1p xxxx sp xxxx~
    [[https://stackoverflow.com/questions/2549214/interpreting-segfault-messages][linux - Interpreting segfault messages - Stack Overflow]]
*** 正则表达式过滤指定字符串
    [[http://www.aqee.net/post/regular-expression-to-match-string-not-containing-a-word.html][正则表达式里字符串”不包含”匹配技巧]]
    #+begin_src sh
      ^((?!hello).)*$
    #+end_src
*** 查看 IPC 信息的命令
    - ~ipcs~
*** 栈溢出
    [[https://www.cnblogs.com/zmlctt/p/3987181.html][栈大小和内存分部问题 - zmlctt - 博客园]]
*** ~volatile~
    [[https://stackoverflow.com/questions/246127/why-is-volatile-needed-in-c][declaration - Why is volatile needed in C? - Stack Overflow]]
*** Emacs
**** 匹配中文
     #+begin_src emacs-lisp
       [一-龠]
     #+end_src
**** 多行操作
     [[http://blog.lujun9972.win/blog/2016/11/18/emacs%E4%B8%AD%E9%82%A3%E4%BA%9B%E4%B8%8D%E5%B8%B8%E7%94%A8%E7%9A%84%E8%A1%8C%E6%93%8D%E4%BD%9C%E5%91%BD%E4%BB%A4/][Emacs中那些不常用的行操作命令 - 暗无天日]]
**** Projectile Doc
     #+begin_quote
     The contents of =.projectile= are ignored when using the =alien= project indexing method.
     #+end_quote
     [[https://projectile.readthedocs.io/en/latest/projects/#ignoring-files][Projects - Projectile: The Project Interaction Library for Emacs]]
*** Differences between =RUID= and =EUID=
    [[https://stackoverflow.com/questions/32455684/difference-between-real-user-id-effective-user-id-and-saved-user-id][linux - Difference between Real User ID, Effective User ID and Saved User ID - Stack Overflow]]
*** static 用法 [fn:2]
    - 全局
      - 变量在全局数据分配空间, 仅对当前文件可见
      - 函数与变量类似, 仅当前文件可以访问
    - 局部
      - 变量放到全局数据区, 初始化为 0, 且函数返回也不修改其值
*** 使用 ~snprintf~ 替换 ~strcpy/sprintf/strncpy~
    - strcpy/sprintf 不检验字符串长度, 可能溢出
    - strncpy <len 时 对剩余部分补 0, 占用 CPU 时间, =len 时 不对结尾补 0
** Book Notes
*** Design Pattern
**** [[file:books/design/Head_First_C/Head_First_C.org::*Head First C][Head First C]]
*** AD
    [[https://en.wikipedia.org/wiki/Active_Directory][Active Directory]]
*** Kernel
**** Linux 内核完全注释
**** [[file:books/kernel/Linux_Kernel_Development/NOTEs.org::*Linux Kernel Development][Linux Kernel Development]]
*** System
**** [[file:books/system/SICP/SICP.org::*Structure and Interpreter of Computre Programs][Structure and Interpreter of Computre Programs]]                    :SICP:
**** [[file:books/system/Shell Programming in Unix, Linux and OS X_ - Stephen G. Kochan/NOTEs.org::*Shell Programming in Unix, Linux and OS X_ - Stephen G. Kochan][Shell Programming in Unix, Linux and OS X_ - Stephen G. Kochan]]
**** [[https://linuxtools-rst.readthedocs.io/zh_CN/latest/index.html][Linux工具快速教程 — Linux Tools Quick Tutorial]]
**** TODO COMMENT [[file:books/system/ULK/ULK.org::*Understanding the LINUX KERNEL][Understanding the LINUX KERNEL]]
**** TODO [[file:books/system/CSAPP/CSAPP.org::*Computer System: A Programmer's Perspective \[fn:1\]][CSAPP]]
**** TODO [[file:books/system/TLPI/TLPI.org::*The Linux Programming Interface][The Linux Programming Interface]]
**** TODO COMMENT [[file:books/system/TCP_IP/TCP.org::*TCP/IP Illustrated Vol.1][TCP/IP Illustrated Vol.1​]]
     TCP/IP 详解 卷一: 协议
**** DONE [[file:books/system/APUE/APUE.org::*Advanced Programming in the Unix Environment][Advanced Programming in the Unix Environment [76%]​]]
     CLOSED: [2020-02-06 Thu 20:45]
     Stop at Section 17
**** DONE [[file:books/system/vbird_linux_basic_4e/NOTEs.org][Linux鸟哥的私房菜 4e]]
     CLOSED: [2020-02-06 Thu 23:44]
     Stop at Section 17
*** Language
**** C
***** DONE [[file:books/c/ExCP/NOTEs.org][C 专家编程]]
      CLOSED: [2020-03-17 Tue 21:55]
***** DONE Understanding and Using C Pointers
      * void 指针按 char 对齐
      * 非 NULL 指针不相等
      * 常量指针指向非常量
***** DONE Pointers On C
***** DONE [[file:books/c/C_Traps_and_Pitfalls/NOTEs.org][C 语言陷阱与缺陷]]
      CLOSED: [2020-02-06 Thu 23:46]
**** C++
***** TODO C++ Primer
**** Python
***** DONE [[file:books/python/A Byte of Python/NOTEs.org][A Byte of Python]]
**** Lua
***** DONE [[file:books/lua/Programming in Lua/NOTEs.org][Programming in Lua]] :Too easy to make notes:
      CLOSED: [2020-02-06 Thu 23:43]
**** Go
***** TODO [[file:books/go/GoPL/GoPL.org::*Progress][The Go Programming Language]]
**** AWK
***** [[https://www.tutorialspoint.com/awk/awk_workflow.htm][AWK - Workflow - Tutorialspoint]]
*** database
**** TODO [[file:books/DB/Redis_Design_and_Implementation/NOTEs.org::*Redis 设计与实现][Redis 设计与实现]]
*** VC
**** Git
***** DONE PRO GIT
      CLOSED: [2020-03-03 Tue 12:12]
*** Programming
**** DONE COMMENT [[file:books/programming/CXYDZWXY.org][程序员的自我修养]]
     CLOSED: [2020-02-06 Thu 23:44]
**** TODO [[file:coding/nginx/NGINX.org][深入理解 Nginx]]
*** org-mode
*** Algorithm
