NOTEs.html
<div id="outline-container-org8d53600" class="outline-4">
<h4 id="org8d53600"><code>segfault at 1p xxxx sp xxxx</code></h4>
<div class="outline-text-4" id="text-org8d53600">
<p>
<a href="https://stackoverflow.com/questions/2549214/interpreting-segfault-messages">linux - Interpreting segfault messages - Stack Overflow</a>
</p>
</div>
</div>
<div id="outline-container-org0bbe508" class="outline-4">
<h4 id="org0bbe508">正则表达式过滤指定字符串</h4>
<div class="outline-text-4" id="text-org0bbe508">
<p>
<a href="http://www.aqee.net/post/regular-expression-to-match-string-not-containing-a-word.html">正则表达式里字符串”不包含”匹配技巧</a>
</p>
<div class="org-src-container">
<pre class="src src-sh">^<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>?!hello<span style="color: #bc6ec5;">)</span>.<span style="color: #4f97d7;">)</span>*$
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e13bac" class="outline-4">
<h4 id="org4e13bac">查看 IPC 信息的命令</h4>
<div class="outline-text-4" id="text-org4e13bac">
<ul class="org-ul">
<li><code>ipcs</code></li>
</ul>
</div>
</div>
<div id="outline-container-org02b514d" class="outline-4">
<h4 id="org02b514d">栈溢出</h4>
<div class="outline-text-4" id="text-org02b514d">
<p>
<a href="https://www.cnblogs.com/zmlctt/p/3987181.html">栈大小和内存分部问题 - zmlctt - 博客园</a>
</p>
</div>
</div>
<div id="outline-container-org8a6657c" class="outline-4">
<h4 id="org8a6657c"><code>volatile</code></h4>
<div class="outline-text-4" id="text-org8a6657c">
<p>
<a href="https://stackoverflow.com/questions/246127/why-is-volatile-needed-in-c">declaration - Why is volatile needed in C? - Stack Overflow</a>
</p>
</div>
</div>
<div id="outline-container-orga2c485d" class="outline-4">
<h4 id="orga2c485d">Emacs</h4>
<div class="outline-text-4" id="text-orga2c485d">
</div>
<ul class="org-ul">
<li><a id="orga654187"></a>匹配中文<br />
<div class="outline-text-5" id="text-orga654187">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">[</span>&#19968;-&#40864;<span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</li>
<li><a id="org7c435af"></a>多行操作<br />
<div class="outline-text-5" id="text-org7c435af">
<p>
<a href="http://blog.lujun9972.win/blog/2016/11/18/emacs%E4%B8%AD%E9%82%A3%E4%BA%9B%E4%B8%8D%E5%B8%B8%E7%94%A8%E7%9A%84%E8%A1%8C%E6%93%8D%E4%BD%9C%E5%91%BD%E4%BB%A4/">Emacs中那些不常用的行操作命令 - 暗无天日</a>
</p>
</div>
</li>
<li><a id="org3acbce4"></a>Projectile Doc<br />
<div class="outline-text-5" id="text-org3acbce4">
<blockquote>
<p>
The contents of <code>.projectile</code> are ignored when using the <code>alien</code> project indexing method.
</p>
</blockquote>
<p>
<a href="https://projectile.readthedocs.io/en/latest/projects/#ignoring-files">Projects - Projectile: The Project Interaction Library for Emacs</a>
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org42f2c3b" class="outline-4">
<h4 id="org42f2c3b">Differences between <code>RUID</code> and <code>EUID</code></h4>
<div class="outline-text-4" id="text-org42f2c3b">
<p>
<a href="https://stackoverflow.com/questions/32455684/difference-between-real-user-id-effective-user-id-and-saved-user-id">linux - Difference between Real User ID, Effective User ID and Saved User ID - Stack Overflow</a>
</p>
</div>
</div>
<div id="outline-container-orgc744432" class="outline-4">
<h4 id="orgc744432">static 用法 <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h4>
<div class="outline-text-4" id="text-orgc744432">
<ul class="org-ul">
<li>全局
<ul class="org-ul">
<li>变量在全局数据分配空间, 仅对当前文件可见</li>
<li>函数与变量类似, 仅当前文件可以访问</li>
</ul></li>
<li>局部
<ul class="org-ul">
<li>变量放到全局数据区, 初始化为 0, 且函数返回也不修改其值</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4f1fb76" class="outline-4">
<h4 id="org4f1fb76">使用 <code>snprintf</code> 替换 <code>strcpy/sprintf/strncpy</code></h4>
<div class="outline-text-4" id="text-org4f1fb76">
<ul class="org-ul">
<li>strcpy/sprintf 不检验字符串长度, 可能溢出</li>
<li>strncpy &lt;len 时 对剩余部分补 0, 占用 CPU 时间, =len 时 不对结尾补 0</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb0ca650" class="outline-3">
<h3 id="orgb0ca650">Book Notes</h3>
<div class="outline-text-3" id="text-orgb0ca650">
</div>
<div id="outline-container-org98822fe" class="outline-4">
<h4 id="org98822fe">Design Pattern</h4>
<div class="outline-text-4" id="text-org98822fe">
</div>
<ul class="org-ul">
<li><a id="org9aabd28"></a><a href="books/design/Head_First_C/Head_First_C.html#MissingReference">Head First C</a><br /></li>
</ul>
</div>
<div id="outline-container-org491ac39" class="outline-4">
<h4 id="org491ac39">AD</h4>
<div class="outline-text-4" id="text-org491ac39">
<p>
<a href="https://en.wikipedia.org/wiki/Active_Directory">Active Directory</a>
</p>
</div>
</div>
<div id="outline-container-org00f97a7" class="outline-4">
<h4 id="org00f97a7">Kernel</h4>
<div class="outline-text-4" id="text-org00f97a7">
</div>
<ul class="org-ul">
<li><a id="org2d7cb31"></a>Linux 内核完全注释<br /></li>
<li><a id="orgaebbb86"></a><a href="books/kernel/Linux_Kernel_Development/NOTEs.html#MissingReference">Linux Kernel Development</a><br /></li>
</ul>
</div>
<div id="outline-container-orgebee8a6" class="outline-4">
<h4 id="orgebee8a6">System</h4>
<div class="outline-text-4" id="text-orgebee8a6">
</div>
<ul class="org-ul">
<li><a id="org1258064"></a><a href="books/system/SICP/SICP.html#MissingReference">Structure and Interpreter of Computre Programs</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SICP">SICP</span></span><br /></li>
<li><a id="org0983a25"></a><a href="books/system/Shell Programming in Unix, Linux and OS X_ - Stephen G. Kochan/NOTEs.html#MissingReference">Shell Programming in Unix, Linux and OS X_ - Stephen G. Kochan</a><br /></li>
<li><a id="orgdba3f32"></a><a href="https://linuxtools-rst.readthedocs.io/zh_CN/latest/index.html">Linux工具快速教程 — Linux Tools Quick Tutorial</a><br /></li>
<li><a id="org9a6bd2f"></a><span class="todo TODO">TODO</span> <a href="books/system/CSAPP/CSAPP.html#MissingReference">Computer System: A Programmer's Perspective</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="CSAPP">CSAPP</span></span><br /></li>
<li><a id="org63ef851"></a><span class="todo TODO">TODO</span> <a href="books/system/TLPI/TLPI.html#MissingReference">The Linux Programming Interface</a><br /></li>
<li><a id="orgdabb3d8"></a><span class="done DONE">DONE</span> <a href="books/system/APUE/APUE.html#MissingReference">Advanced Programming in the Unix Environment <code>[76%]</code>​</a><br />
<div class="outline-text-5" id="text-orgdabb3d8">
<p>
Stop at Section 17
</p>
</div>
</li>
<li><a id="orgbea45f6"></a><span class="done DONE">DONE</span> <a href="books/system/vbird_linux_basic_4e/NOTEs.html">Linux鸟哥的私房菜 4e</a><br />
<div class="outline-text-5" id="text-orgbea45f6">
<p>
Stop at Section 17
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org18a295c" class="outline-4">
<h4 id="org18a295c">Language</h4>
<div class="outline-text-4" id="text-org18a295c">
</div>
<ul class="org-ul">
<li><a id="org73a0485"></a>C<br />
<ul class="org-ul">
<li><a id="org7fa0e3a"></a><span class="done DONE">DONE</span> <a href="books/c/ExCP/NOTEs.html">C 专家编程</a><br />
<div class="outline-text-6" id="text-org7fa0e3a">
</div>
</li>
<li><a id="org16001b0"></a><span class="done DONE">DONE</span> Understanding and Using C Pointers<br />
<div class="outline-text-6" id="text-org16001b0">
<ul class="org-ul">
<li>void 指针按 char 对齐</li>
<li>非 NULL 指针不相等</li>
<li>常量指针指向非常量</li>
</ul>
</div>
</li>
<li><a id="org9803f9d"></a><span class="done DONE">DONE</span> Pointers On C<br /></li>
<li><a id="org7f519cd"></a><span class="done DONE">DONE</span> <a href="books/c/C_Traps_and_Pitfalls/NOTEs.html">C 语言陷阱与缺陷</a><br />
<div class="outline-text-6" id="text-org7f519cd">
</div>
</li>
</ul>
</li>
<li><a id="orgcf025bd"></a>C++<br />
<ul class="org-ul">
<li><a id="orge8f65cf"></a><span class="todo TODO">TODO</span> C++ Primer<br /></li>
</ul>
</li>
<li><a id="org6f45e05"></a>Python<br />
<ul class="org-ul">
<li><a id="org318b43b"></a><span class="done DONE">DONE</span> <a href="books/python/A Byte of Python/NOTEs.html">A Byte of Python</a><br /></li>
</ul>
</li>
<li><a id="org65de99a"></a>Lua<br />
<ul class="org-ul">
<li><a id="orgaef7df0"></a><span class="done DONE">DONE</span> <a href="books/lua/Programming in Lua/NOTEs.html">Programming in Lua</a> :Too easy to make notes:<br />
<div class="outline-text-6" id="text-orgaef7df0">
</div>
</li>
</ul>
</li>
<li><a id="org9ddcacf"></a>Go<br />
<ul class="org-ul">
<li><a id="org14bd38c"></a><span class="todo TODO">TODO</span> <a href="books/go/GoPL/GoPL.html#MissingReference">The Go Programming Language</a><br /></li>
</ul>
</li>
<li><a id="org6a45266"></a>AWK<br />
<ul class="org-ul">
<li><a id="org5357df8"></a><a href="https://www.tutorialspoint.com/awk/awk_workflow.htm">AWK - Workflow - Tutorialspoint</a><br /></li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orga991eaf" class="outline-4">
<h4 id="orga991eaf">数据库</h4>
<div class="outline-text-4" id="text-orga991eaf">
</div>
<ul class="org-ul">
<li><a id="org481ccfc"></a><span class="todo TODO">TODO</span> <a href="books/DB/Redis_Design_and_Implementation/NOTEs.html#MissingReference">Redis 设计与实现</a><br /></li>
</ul>
</div>
