NOTEs.org
**** [[file:books/algorithm/Programming Pearls/NOTEs.org::*Programming Pealrs][Programming Pealrs]]
**** Leetcode
***** Array
****** Remove Elements
******* Q:
        Given an array and a value, remove all instances of that > value in place and return the new length.

        The order of elements can be changed. It doesn't matter what you leave beyond the new length.
******* A:
        #+begin_src c
          int remove_elem(int A[], int n, int elem) {
              int i = 0;
              int j = 0;

              for (; j < n; ++j) {
                  if (A[j] == elem) {

                  } else {
                      A[i] = A[j];
                      i ++;
                  }


              }
          }
        #+end_src
****** Two Sum
******* Q:
        Given an array of integers, return indices of the two numbers such that they add up to a specific target.
        You may assume that each input would have exactly one solution, and you may not use the same element twice.

        *Example:*
        #+begin_src
     Given nums = [2, 7, 11, 15], target = 9,

     Because nums[0] + nums[1] = 2 + 7 = 9,
     return [0, 1].
        #+end_src
******* A:
        #+begin_src C
          int* twoSum(int* nums, int numsSize, int target) {
              int  i   = 0;
              int  j   = 0;
              int* res = (int*)calloc(2, sizeof(int));
              for (i = 0; i < numsSize - 1; ++i) {
                  for (j = i + 1; j < numsSize; ++j) {
                      if (nums[i] + nums[j] == target) {
                          res[0] = i;
                          res[1] = j;
                          break;
                      }
                  }
              }
              return res;
          }
        #+end_src
****** Median of Two Sorted Arrays
******* Q:
        There are two sorted arrays nums1 and nums2 of size m and n respectively.
        Find the median of the two sorted arrays. The overall run time complexity should be O(log (m+n)).
******* A:
        *思路: * 合并数组, 计算中间下标的平均数.
*** Others
**** TODO [[file:books/暗时间.org][暗时间]]
**** DONE [[file:psycology/NOTEs.org::*人性的弱点][人性的弱点]]
     CLOSED: [2021-12-24 Fri 15:04]
**** [[https://www.cnblogs.com/Open_Source/archive/2011/07/17/2108747.html][Org-mode 简明手册 - open source - 博客园]]
**** 区块链
***** 前言
      [[http://blog.codinglabs.org/articles/bitcoin-mechanism-make-easy.html][CodingLabs - 一个故事告诉你比特币的原理及运作机制]] \\
      [[http://www.8btc.com/what-is-blockchain][区块链是什么 | 巴比特]]
***** DONE 比特币
      CLOSED: [2020-03-03 Tue 12:12]
****** 白皮书
       [[https://bitcoin.org/bitcoin.pdf][bitcoin.pdf]]
****** mastering bitcoin
***** 以太坊
** 随笔
*** Principles of Git
**** 每次 commit 只做一件事
     针对某一项某一任务的更改
**** commit 不能破坏构建
     每个步骤都必须完全起作用, 并且不引起退化.
**** 永远不要rebase公共分支
     rebase他人使用的公共分支后, 已重新基准化的commit将不再与基于原commit匹配
**** 保留定义明确的commit日志
     必须在更改的commit日志中做出说明, 让所有人了解与正在进行的更改相关的所有内容.
**** 所有代码都是二等分的
**** Git正确合并
**** 持续测试和集成
*** Frequent git commands
    #+begin_src sh
      git init
      git clone
      git commit
      git remote add/set-url/...
      git fetch
      git merge
      git pull (git fetch && git merge)
      git push
      git checkout
      git branch
      git reflog
    #+end_src
* COMMENT 金融 && 股票
  * [[file:eco/NOTEs.org::*股票][股票]]
  * [[file:eco/NOTEs.org::*金融][金融]]
* TODO 待学
** 汇编
** 算法
** 源码学习
*** libevent/libuv
*** linux
** 服务器
*** 网络
**** 协议
     * TCP/IP Illustrate
     * Unix Network Programming
**** 性能
***** 数据库
      * 高性能 MySQL
** Linux 内核及驱动
