NOTEs.html
<div id="outline-container-org6d609a6" class="outline-4">
<h4 id="org6d609a6">版本控制</h4>
<div class="outline-text-4" id="text-org6d609a6">
</div>
<ul class="org-ul">
<li><a id="orgf175028"></a>Git<br />
<ul class="org-ul">
<li><a id="orga1d7df7"></a><span class="done DONE">DONE</span> PRO GIT<br />
<div class="outline-text-6" id="text-orga1d7df7">
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org7f46831" class="outline-4">
<h4 id="org7f46831">其他</h4>
<div class="outline-text-4" id="text-org7f46831">
</div>
<ul class="org-ul">
<li><a id="orgf76b1aa"></a><span class="todo TODO">TODO</span> <a href="coding/nginx/NGINX.html">深入理解 Nginx</a><br /></li>
</ul>
</div>
<div id="outline-container-org8880cf8" class="outline-4">
<h4 id="org8880cf8">org-mode</h4>
<div class="outline-text-4" id="text-org8880cf8">
<ul class="org-ul">
<li><a href="https://www.cnblogs.com/Open_Source/archive/2011/07/17/2108747.html">Org-mode 简明手册 - open source - 博客园</a></li>
</ul>
</div>
</div>
<div id="outline-container-org139d252" class="outline-4">
<h4 id="org139d252">区块链</h4>
<div class="outline-text-4" id="text-org139d252">
</div>
<ul class="org-ul">
<li><a id="org5e2a04d"></a>前言<br />
<div class="outline-text-5" id="text-org5e2a04d">
<p>
<a href="http://blog.codinglabs.org/articles/bitcoin-mechanism-make-easy.html">CodingLabs - 一个故事告诉你比特币的原理及运作机制</a> <br />
<a href="http://www.8btc.com/what-is-blockchain">区块链是什么 | 巴比特</a>
</p>
</div>
</li>
<li><a id="org44a3bf9"></a><span class="done DONE">DONE</span> 比特币<br />
<div class="outline-text-5" id="text-org44a3bf9">
</div>
<ul class="org-ul">
<li><a id="org793dd7b"></a>白皮书<br />
<div class="outline-text-6" id="text-org793dd7b">
<p>
<a href="https://bitcoin.org/bitcoin.pdf">bitcoin.pdf</a>
</p>
</div>
</li>
<li><a id="org45f4f4a"></a>mastering bitcoin<br /></li>
</ul>
</li>
<li><a id="orgb003219"></a>以太坊<br /></li>
</ul>
</div>
<div id="outline-container-org263c49b" class="outline-4">
<h4 id="org263c49b">算法</h4>
<div class="outline-text-4" id="text-org263c49b">
</div>
<ul class="org-ul">
<li><a id="orgda2673e"></a><a href="books/algorithm/Programming Pearls/NOTEs.html#MissingReference">Programming Pealrs</a><br /></li>
<li><a id="org95569ec"></a>Leetcode<br />
<ul class="org-ul">
<li><a id="org43d3d0c"></a>Array<br />
<ul class="org-ul">
<li><a id="orgfcd8e8b"></a>Remove Elements<br />
<ul class="org-ul">
<li><a id="orgaaaa3bc"></a>Q:<br />
<div class="outline-text-8" id="text-orgaaaa3bc">
<p>
Given an array and a value, remove all instances of that &gt; value in place and return the new length.
</p>

<p>
The order of elements can be changed. It doesn't matter what you leave beyond the new length.
</p>
</div>
</li>
<li><a id="org0f73404"></a>A:<br />
<div class="outline-text-8" id="text-org0f73404">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">remove_elem</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">A</span><span style="color: #bc6ec5;">[]</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">elem</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = <span style="color: #a45bad;">0</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span> = <span style="color: #a45bad;">0</span>;

    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>; j &lt; n; ++j<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>A<span style="color: #67b11d;">[</span>j<span style="color: #67b11d;">]</span> == elem<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>

        <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #2d9574;">{</span>
            A<span style="color: #67b11d;">[</span>i<span style="color: #67b11d;">]</span> = A<span style="color: #67b11d;">[</span>j<span style="color: #67b11d;">]</span>;
            i ++;
        <span style="color: #2d9574;">}</span>


    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org9f02f27"></a>Two Sum<br />
<ul class="org-ul">
<li><a id="orge692393"></a>Q:<br />
<div class="outline-text-8" id="text-orge692393">
<p>
Given an array of integers, return indices of the two numbers such that they add up to a specific target.
You may assume that each input would have exactly one solution, and you may not use the same element twice.
</p>

<p>
<b>Example:</b>
</p>
<pre class="example">
Given nums = [2, 7, 11, 15], target = 9,

Because nums[0] + nums[1] = 2 + 7 = 9,
return [0, 1].
</pre>
</div>
</li>
<li><a id="orgb123eb1"></a>A:<br />
<div class="outline-text-8" id="text-orgb123eb1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ce537a; font-weight: bold;">int</span>* <span style="color: #bc6ec5; font-weight: bold;">twoSum</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">int</span>* <span style="color: #7590db;">nums</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">numsSize</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">target</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">int</span>  <span style="color: #7590db;">i</span>   = <span style="color: #a45bad;">0</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span>  <span style="color: #7590db;">j</span>   = <span style="color: #a45bad;">0</span>;
    <span style="color: #ce537a; font-weight: bold;">int</span>* <span style="color: #7590db;">res</span> = <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">int</span>*<span style="color: #bc6ec5;">)</span>calloc<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #4f97d7; font-weight: bold;">sizeof</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">int</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #bc6ec5;">(</span>i = <span style="color: #a45bad;">0</span>; i &lt; numsSize - <span style="color: #a45bad;">1</span>; ++i<span style="color: #bc6ec5;">)</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #2d9574;">(</span>j = i + <span style="color: #a45bad;">1</span>; j &lt; numsSize; ++j<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>nums<span style="color: #b1951d;">[</span>i<span style="color: #b1951d;">]</span> + nums<span style="color: #b1951d;">[</span>j<span style="color: #b1951d;">]</span> == target<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                res<span style="color: #b1951d;">[</span><span style="color: #a45bad;">0</span><span style="color: #b1951d;">]</span> = i;
                res<span style="color: #b1951d;">[</span><span style="color: #a45bad;">1</span><span style="color: #b1951d;">]</span> = j;
                <span style="color: #4f97d7; font-weight: bold;">break</span>;
            <span style="color: #67b11d;">}</span>
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> res;
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</li>
</ul>
</li>
<li><a id="org852705a"></a>Median of Two Sorted Arrays<br />
<ul class="org-ul">
<li><a id="org26c34c1"></a>Q:<br />
<div class="outline-text-8" id="text-org26c34c1">
<p>
There are two sorted arrays nums1 and nums2 of size m and n respectively.
Find the median of the two sorted arrays. The overall run time complexity should be O(log (m+n)).
</p>
</div>
</li>
<li><a id="orgb48b769"></a>A:<br />
<div class="outline-text-8" id="text-orgb48b769">
<p>
*思路: * 合并数组, 计算中间下标的平均数.
</p>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgd03cdee" class="outline-4">
<h4 id="orgd03cdee">时间管理</h4>
<div class="outline-text-4" id="text-orgd03cdee">
</div>
<ul class="org-ul">
<li><a id="org7617259"></a><span class="todo TODO">TODO</span> <a href="books/暗时间.html">暗时间</a><br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgb5dc847" class="outline-3">
<h3 id="orgb5dc847">随笔</h3>
<div class="outline-text-3" id="text-orgb5dc847">
</div>
<div id="outline-container-org4cdfcd8" class="outline-4">
<h4 id="org4cdfcd8">Principles of Git</h4>
<div class="outline-text-4" id="text-org4cdfcd8">
</div>
<ul class="org-ul">
<li><a id="org9bf9edd"></a>每次 commit 只做一件事<br />
<div class="outline-text-5" id="text-org9bf9edd">
<p>
针对某一项某一任务的更改
</p>
</div>
</li>
<li><a id="org2c53e73"></a>commit 不能破坏构建<br />
<div class="outline-text-5" id="text-org2c53e73">
<p>
每个步骤都必须完全起作用, 并且不引起退化.
</p>
</div>
</li>
<li><a id="org72ff1a1"></a>永远不要rebase公共分支<br />
<div class="outline-text-5" id="text-org72ff1a1">
<p>
rebase他人使用的公共分支后, 已重新基准化的commit将不再与基于原commit匹配
</p>
</div>
</li>
<li><a id="orgb28d639"></a>保留定义明确的commit日志<br />
<div class="outline-text-5" id="text-orgb28d639">
<p>
必须在更改的commit日志中做出说明, 让所有人了解与正在进行的更改相关的所有内容.
</p>
</div>
</li>
<li><a id="org23cc340"></a>所有代码都是二等分的<br /></li>
<li><a id="orge4643bf"></a>Git正确合并<br /></li>
<li><a id="org8d49b97"></a>持续测试和集成<br /></li>
</ul>
</div>
<div id="outline-container-orgd21f458" class="outline-4">
<h4 id="orgd21f458">Frequent git commands</h4>
<div class="outline-text-4" id="text-orgd21f458">
<div class="org-src-container">
<pre class="src src-sh">git init
git clone
git commit
git remote add/set-url/...
git fetch
git merge
git pull <span style="color: #4f97d7;">(</span>git fetch &amp;&amp; git merge<span style="color: #4f97d7;">)</span>
git push
git checkout
git branch
git reflog
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb057ccb" class="outline-2">
<h2 id="orgb057ccb"><span class="todo TODO">TODO</span> 待学</h2>
<div class="outline-text-2" id="text-orgb057ccb">
</div>
<div id="outline-container-orge5aac58" class="outline-3">
<h3 id="orge5aac58">汇编</h3>
</div>
<div id="outline-container-orgaca7ca2" class="outline-3">
<h3 id="orgaca7ca2">算法</h3>
</div>
<div id="outline-container-org7645bf0" class="outline-3">
<h3 id="org7645bf0">源码学习</h3>
<div class="outline-text-3" id="text-org7645bf0">
</div>
<div id="outline-container-org079e065" class="outline-4">
<h4 id="org079e065">libevent/libuv</h4>
</div>
<div id="outline-container-org0bc95b9" class="outline-4">
<h4 id="org0bc95b9">linux</h4>
</div>
</div>
<div id="outline-container-org3b47661" class="outline-3">
<h3 id="org3b47661">服务器</h3>
<div class="outline-text-3" id="text-org3b47661">
</div>
<div id="outline-container-org85c3f60" class="outline-4">
<h4 id="org85c3f60">网络</h4>
<div class="outline-text-4" id="text-org85c3f60">
</div>
<ul class="org-ul">
<li><a id="org0548fb1"></a>协议<br />
<div class="outline-text-5" id="text-org0548fb1">
<ul class="org-ul">
<li>TCP/IP Illustrate</li>
<li>Unix Network Programming</li>
</ul>
</div>
</li>
